features/blocks.html
<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Unknown block</h2>
<div class="outline-text-2" id="text-1">





<pre class="example">defmodule Enum do
  def map(collection, fun) do
    Enumerable.reduce(collection, [], fn(x, acc) -&gt;
      [fun.(x, acc)|acc]
    end) |&gt; reverse
  end
end
</pre>



<pre class="example">
def initialize(output)
  @output = output
  @buffer = ""
  @output_type = :start
  @list_indent_stack = []
  @paragraph_modifier = nil

  @logger = Logger.new(STDERR)
  @logger.level = Logger::WARN
end

</pre>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Example with a leading comma</h2>
<div class="outline-text-2" id="text-2">





<pre class="example">puts "Hello world " \
* 8
</pre>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Quote block</h2>
<div class="outline-text-2" id="text-3">




Testing that I can have block quotes:

<blockquote>




/Example:/

This is blockquote text.


</blockquote>




And now I'm back to normal text!

</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Commented blocks</h2>
<div class="outline-text-2" id="text-4">


<p>
The following will not be rendered because it is a comment block.
</p>

</div>
</div>
